---
kind: method
id: M:Autodesk.Revit.DB.RevisionCloud.IsRevisionIssued
source: html/5ae26bdd-b1f8-3771-c02f-538a523f8457.htm
---
# Autodesk.Revit.DB.RevisionCloud.IsRevisionIssued Method

Indicates whether the Revision associated with this RevisionCloud has been issued.

## Syntax (C#)
```csharp
public bool IsRevisionIssued()
```

## Returns
True if the Revision has been issued, False otherwise.